{
  "app-title": "Helenas Portfolio",
  "about-me": "Über mich",
  "and": "und",
  "backend-node": "Backend-Entwicklung mit Node.js",
  "backend-node-exp-mong": "Backend-Entwicklung mit Node.js, Express und MongoDB",
  "cgn": "Köln",
  "classes-obj": "Klassen und Objekte",
  "complex-types": "Komplexe Typen (Arrays, Custom Types)",
  "conditions-logical": "Bedingungen und logische Operatoren",
  "contact": "Kontakt",
  "data-validation": "Datenvalidierung",
  "description-adventeire": "Mobile-first Abschlussarbeit für das neue fische Bootcamps. Nutzer können durch eine Liste von Sehenswürdigkeiten in Irland browsen, bestimmte Sehenswürdigkeiten als Favorit markieren, eine Detailansicht aufrufen, Sehenswürdigkeiten auf eine eigene Reisroute setzen, sowie Pins aller Sehenswürdigkeiten der Datenbank auf einer Karte von Mapbox einsehen. Deployed mit Heroku.",
  "description-choredoor": "Ziel dieses Spiels ist es alle Türen zu öffnen ohne dem ChoreBot(rechts) zu begegnen, der andernfalls die Spielrunde sofort beendet. Zwei Zähler zeigen die aktuelle Gewinnserie sowie den Serienrekord der Sitzung an. Deployed mit GitHub Pages. (HTML und CSS großteils von Codecademy bereitgestellt)",
  "description-domindme": "Aktuell in Entwicklung! To Do App mit Login und Anbindung an eine Datenbank. Der aktuelle Feature-Stand kann in der README.md auf GitHub eingesehen werden.",
  "description-fadi": "Frontend-Entwicklung von Online-Shops mit React, Apollo GraphQL, TypeScript, serverseitiges Node.js, HTML5, CSS3, Dust.js für Mobile und Desktop.",
  "description-mobilab": "Interne und externe Projekte von Web-Plattformen mit React (Next.js), TypeScript, styled-components, REST APIs, Recoil, react-query anhand von Figma-Designs.",
  "description-neuefische": "Intensiv-Coding-Bootcamp in 540 Stunden Programmierpraxis mit Eigenentwicklung einer App als Abschlussarbeit hauptsächlich mit React und styled-components.",
  "description-neuefische_2": "Intensiv-Coding-Bootcamp in 540 Stunden Programmierpraxis mit Entwicklung eines vierwöchigen Abschlussprojekts in Teamarbeit hauptsächlich mit Python, SQL und Tableau.",
  "description-pokemon": "Mobile-first Pokemon-App im Rahmen des neue fische Bootcamps, bei der die Daten von einer API gezogen wurden. Auf der Pokemon-Seite kann man durch eine Suchleiste bestimmte Pokemon suchen und sie per Button auf seine Favoriten-Liste setzen. Über den Info-Button werden weitere Details über das jeweilige Pokemon angezeigt. Gruppenprojekt zusammen mit Bejan Afshar, Lukas Kurpiela und Sharine Ankenbrand, deployed mit Vercel.",
  "description-quizney": "Mobile-first Quiz-App mit Fragen rund um Disney im Rahmen des neue fische Bootcamps. Die Home Seite beinhaltet Fragen mit vier Antwortmöglichkeiten. Bei Klick auf eine Antwort wird angezeigt, ob diese richtig oder falsch ist. Die anderen Seiten sind Bookmarks (noch nicht funktional), Eintragen von neuen Fragen (nicht funktional), sowie eine Profilseite (statisch). Deployed mit Vercel.",
  "description-quizney-react": "Mobile-first Quiz-App mit Fragen rund um Disney im Rahmen des neue fische Bootcamps. Die Home Seite beinhaltet Fragen mit vier Antwortmöglichkeiten. Bei Klick auf eine Antwort wird angezeigt, ob diese richtig oder falsch ist. Die anderen Seiten sind Bookmarks, welche auf Klick auf das Kronen-Icon hinzugefügt bzw. entfernt werden. Das Neue-Fragen-Formulat ist (noch) nicht funktional, genau wie die Profilseite (statisch). Deployed mit Vercel.",
  "description-rest-countries": "Mobile-first App mit Hilfe der rest-countries API. Auf der Startseite kann nach Ländern gesucht und nach Kontinenten gefiltert werden. Durch Klick auf ein Land kommt man auf eine Detail-Seite mit mehreren Informationen. Über einen Theme Switcher kann man zwischen Light und Dark Mode wechseln. Deployed mit Vercel.",
  "description-rock-paper-scissors": "Mobile-first App des klassischen Schere-Stein-Papier-Spiels. Bei Auswahl einer Option wird zufällig die des Computers generiert und das Ergebnis berechnet. Ein Gewinn gibt +1 Punkt, Unentschieden 0 und Niederlage -1. Durch Local Storage bleibt der Zwischenstand auch beim Neuladen des Browsers erhalten. Deployed mit Vercel.",
  "developer": "Entwicklerin",
  "frontend-react-jsx": "Frontend-Anwendungen mit React & JSX",
  "full-view": "Vollansicht",
  "functions": "Funktionen",
  "functions-incl": "Funktionen (inkl. eingebaute)",
  "intro": "Ich bin Helena, Junior Frontend Entwicklerin mit der Motivation sowohl mich als auch Projekte ständig auf neue Arten und Weisen weiter zu entwickeln. <br /> Bisher habe ich im Beruf in internationalen, cross-funktionalen Teams Erfahrungen mit React und Next.js mit TypeScript und styled-components gesammelt.<br/>Da ich mich dafür interessiere, die stetig wachsende Welt der Daten von einer anderen Seite zu entdecken, mache ich seit Mai 2023 eine Weiterbildung in Data Analytics.",
  "loops": "Schleifen",
  "projects": "Projekte",
  "remote": "Remote",
  "skills-certificates": "Kenntnisse & Zertifikate",
  "skills-certificates-nav": "Kenntnisse<span class=mobilehide> & Zertifikate</span>",
  "sql-dbs": "SQL & Datenbanken",
  "tdd": "Test Driven Development mit Mocha & Node.js",
  "welcome": "Hallo und herzlich willkommen auf meinem Portfolio!",
  "work-experience": "Berufserfahrung"
}
