{
  "app-title": "Helena's Portfolio",
  "about-me": "About me",
  "and": "and",
  "backend-node": "Backend development with Node.js",
  "backend-node-exp-mong": "Backend development with Node.js, Express and MongoDB",
  "cgn": "Cologne",
  "classes-obj": "Classes and objects",
  "complex-types": "Complex types (arrays, custom types)",
  "conditions-logical": "Conditions and logical operators",
  "contact": "Contact",
  "data-validation": "Data validation",
  "description-adventeire": "Mobile-first capstone project for the web development bootcamp at neue fische. Users can browse through a list of sights in Ireland, add sights to favorites, view sight details, and add sights to an itinerary. Deployed with Heroku.",
  "description-choredoor": "This game's aim is to open all the doors without encountering the ChoreBot (right), which will otherwise terminate the game immediately. Two counters show the current winning streak as well as the session's streak record. Deployed with GitHub Pages. (HTML and CSS mainly provided by Codecademy)",
  "description-fadi": "Frontend development of online shops with React, Apollo GraphQL, Typescript, as well as server-side Node.js, HTML5, CSS3, Dust.js for mobile and desktop.",
  "description-mobilab": "Internal and external projects of web applications with React (Next.js), TypeScript, styled-components, REST APIs, Recoil, react-query based on Figma designs.",
  "description-neuefische": "Intensive 540-hour coding bootcamp developing an own app as a capstone project, mainly with React and styled-components.",
  "description-pokemon": "Mobile-first Pokemon app created during the neue fische bootcamp with a public API. The user can use the search bar to find a specific Pokémon and add it to theit favorites by clicking a button. By clicking the info button, more details about the Pokémon will be displayed. Group project together with Bejan Afshar, Lukas Kurpiela and Sharine Ankenbrand, deployed with Vercel.",
  "description-quizney": "Mobile-first quiz app with questions about Disney created during the neue fische bootcamp. The Home page contains questions with four possible answers. By clicking an option, the user will see if it is right or wrong. The other pages are bookmarks (not yet functional), submitting new questions (not functional), as well as a profile page (static). Deployed with Vercel.",
  "description-quizney-react": "Mobile-first quiz app with questions about Disney created during the neue fische bootcamp. The Home page contains questions with four possible answers. By clicking an option, the user will see if it is right or wrong. One of the other pages is Bookmarks, which are added or removed by clicking the crown icon. The form for new questions is not yet functional, as well as the profile page (static). Deployed with Vercel.",
  "developer": "Developer",
  "frontend-react-jsx": "Frontend applications with React & JSX",
  "functions": "Functions",
  "functions-incl": "Functions (incl. built-in)",
  "intro": "Ich bin Helena, Junior Frontend Entwicklerin mit der Motivation sowohl mich als auch Projekte ständig auf neue Arten und Weisen weiter zu entwickeln. <br /> Während des letzten Jahres im Beruf habe ich in internationalen, cross-funktionalen Teams Erfahrungen mit unter anderem React und Next.js mit TypeScript, styled-components und Tailwind gesammelt.",
  "loops": "Loops",
  "projects": "Projects",
  "skills-certificates": "Skills & Certificates",
  "skills-certificates-nav": "Skills<span class=`mobilehide`> & Certificates</span>",
  "sql-dbs": "SQL & Data bases",
  "tdd": "Test Driven Development with Mocha & Node.js",
  "welcome": "Hello and welcome to my portfolio!",
  "work-experience": "Work experience"
}
